app/views/posts/_comment_list.html.erb

<% post.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ? ORDER BY "comments"."created_at" DESC  [["post_id", 1]]