app/views/posts/_photos.html.erb

<%= link_to post_path(post) do %>
  <% if post.photos.size == 1 %>
---
SELECT  "photos".* FROM "photos" WHERE "photos"."post_id" = ? ORDER BY "photos"."id" ASC LIMIT ?  [["post_id", 2], ["LIMIT", 1]]
SELECT COUNT(*) FROM "photos" WHERE "photos"."post_id" = ?  [["post_id", 2]]