app/controllers/bookmarks_controller.rb

  def create
    @bookmark = current_user.bookmarks.build(bookmark_params)
    if @bookmark.save
---
INSERT INTO "bookmarks" ("post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 1], ["user_id", 1], ["created_at", "2018-12-18 15:21:37.147281"], ["updated_at", "2018-12-18 15:21:37.147281"]]

  def destroy
    @bookmark = Bookmark.find(params[:id])
    @article = @bookmark.article
    if @bookmark.destroy
---
SELECT  "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "bookmarks" WHERE "bookmarks"."id" = ?  [["id", 5]]