app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "cool!!!"], ["post_id", 2], ["user_id", 2], ["created_at", "2018-12-20 03:19:12.710025"], ["updated_at", "2018-12-20 03:19:12.710025"]]
---
  def create
    @comment = Comment.new(comment_params)
    if @comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 8]]
---
  def destroy
    @comment = Comment.find(params[:id])
    @article = @comment.article
    if @comment.destroy