app/controllers/likes_controller.rb

INSERT INTO "likes" ("post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 1], ["user_id", 1], ["created_at", "2018-12-18 15:21:35.551433"], ["updated_at", "2018-12-18 15:21:35.551433"]]
---
  def create
    @like = current_user.likes.build(like_params)
    @article = @like.article
    if @like.save

SELECT  "likes".* FROM "likes" WHERE "likes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 2]]
---
  def destroy
    @like = Like.find(params[:id])
    @article = @like.article
    if @like.destroy