app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (name LIKE '%h%')
---
  def index
    @users = User.search(params[:term])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def following
    @title = "Following"
    @user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def followers
    @title = "Followers"
    @user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "photos".* FROM "photos" WHERE "photos"."post_id" = ? ORDER BY "photos"."id" ASC LIMIT ?  [["post_id", 2], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" IN (1, 2) ORDER BY "comments"."created_at" DESC
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" IN (1, 2) ORDER BY "likes"."created_at" DESC
SELECT "posts".* FROM "posts" INNER JOIN "bookmarks" ON "bookmarks"."post_id" = "posts"."id" WHERE "posts"."suser_id" = ?  [["suser_id", 1]]
---
  def show
    @user = User.find(params[:id])
    @posts = @user.posts.includes(:photos, :likes, :comments)

SELECT  "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"
---
  def list_user
    @users = User.all.paginate(:page => params[:page], :per_page => 6)